[Rainmeter]
Author=Xyrfo and fediaFedia
MouseActionCursor=0
Update=8650000

[Metadata]
Version=5.0
Information=Intro Galler
License=Creative Commons Attribution-NonCommercial-NoDerivs 3.0

[Variables]
@include=#ROOTCONFIGPATH#Common\Variables\UserVariables.inc
@include2=#ROOTCONFIGPATH#Panels\Slideshow\UserVariables.inc
@include3=#ROOTCONFIGPATH#Common\Variables\Languages\lang.inc
WeatherCode=E:\Users\User\Documents\Rainmeter\Skins\WP7\Panels\Weather\UserVariables.inc
ImageNumber=2

[MeasureWeatherCode]
Measure=Plugin
Plugin=Plugins\WebParser.dll
Url=http://8iplocationtools.com/index.php
RegExp="(?siU)Weather Station Code.*<td align=\"left\">(.*)</td>"
StringIndeX=1
FinishAction=!Update "#CURRENTCONFIG#"

[line1]
Meter=Image
SolidColor=255,255,255,150
W=620
H=1
X=3
Y=2

[line2]
Meter=Image
SolidColor=255,255,255,150
W=1
H=288
Y=2
X=2

[line3]
Meter=Image
SolidColor=255,255,255,150
W=619
H=1
Y=289
X=3

[line4]
Meter=Image
SolidColor=255,255,255,150
W=1
H=287
Y=3
X=622

[Background0]
Meter=Image
solidcolor=40,40,40
W=623
H=290
X=0
Y=0

[Backgroundimg]
Meter=Image
ImageName=#CURRENTPATH#\GalleryImages\welcomebg.jpg
X=1
Y=1
w=621
h=140

[welcomeText0]
Meter=String
FontColor=0,0,0,100
FontSize=60
FontFace=Segoe WP
AntiAlias=1
StringAlign=CENTER
y=10
X=311
Text=language

[welcomeText]
Meter=String
FontColor=255,255,255,255
FontSize=60
FontFace=Segoe WP
AntiAlias=1
StringAlign=CENTER
y=-1r
X=311
Text=language

[bgsi]
SolidColor=0,255,0,150
SolidColor2=0,150,0,150
W=145
H=35
GradientAngle=90
X=r
Y=45r

[resstyle]
FontColor=255,255,255
FontSize=15
FontFace=Segoe WP
AntiAlias=1
StringAlign=CENTER
X=80
Hidden=0

[styk]
W=115
H=27
X=r
Y=2R
SolidColor=60,60,60
AntiAlias=1
FontFace=Segoe UI
StringAlign=CENTER
FontSize=12
FontColor=255,255,255

[en]
Meter=String
Text=English
MeterStyle=Styk
Y=160
X=77
LeftMouseUpAction=!Execute ["#ROOTCONFIGPATH#Common\omnimoapp.exe" Lang English "#SKINSPATH#"][!ActivateConfig "WP7\Gallery\Intro" "introThemeWP7.ini"]
solidcolor=100,175,27
ToolTipText=by fediaFedia

[de]
Meter=String
Text=Deutsch
MeterStyle=Styk
LeftMouseUpAction=!Execute ["#ROOTCONFIGPATH#Common\omnimoapp.exe" Lang German "#SKINSPATH#"][!ActivateConfig "WP7\Gallery\Intro" "introThemeWP7.ini"]
ToolTipText=übersetzt ins Deutsche von MaskedJudas

[rus]
Meter=String
Text=Русский
MeterStyle=Styk
LeftMouseUpAction=!Execute ["#ROOTCONFIGPATH#Common\omnimoapp.exe" Lang Russian "#SKINSPATH#"][!ActivateConfig "WP7\Gallery\Intro" "introThemeWP7.ini"]
ToolTipText=Алекс Джэймс (vk.com/alexrodichev)

[pt]
Meter=String
Text=Português
MeterStyle=Styk
LeftMouseUpAction=!Execute ["#ROOTCONFIGPATH#Common\omnimoapp.exe" Lang Portuguese "#SKINSPATH#"][!ActivateConfig "WP7\Gallery\Intro" "introThemeWP7.ini"]
ToolTipText=Pedro gon Wilmont/ http://pedro9666.deviantart.com/

[es]
Meter=String
Text=Español
MeterStyle=Styk
Y=160
X=2R
LeftMouseUpAction=!Execute ["#ROOTCONFIGPATH#Common\omnimoapp.exe" Lang Spanish "#SKINSPATH#"][!ActivateConfig "WP7\Gallery\Intro" "introThemeWP7.ini"]
ToolTipText=(Allucard9 / http://allucard9.deviantart.com/)

[fr]
Meter=String
Text=Français
MeterStyle=Styk
LeftMouseUpAction=!Execute ["#ROOTCONFIGPATH#Common\omnimoapp.exe" Lang French "#SKINSPATH#"][!ActivateConfig "WP7\Gallery\Intro" "introThemeWP7.ini"]
ToolTipText=(@ravaged_\Twitter)

[ch]
Meter=String
Text=简体中文
MeterStyle=Styk
LeftMouseUpAction=!Execute ["#ROOTCONFIGPATH#Common\omnimoapp.exe" Lang Chinese "#SKINSPATH#"][!ActivateConfig "WP7\Gallery\Intro" "introThemeWP7.ini"]
ToolTipText=(小不 / http://xaob.tk/)

[it]
Meter=String
Text=Italiano
MeterStyle=Styk
LeftMouseUpAction=!Execute ["#ROOTCONFIGPATH#Common\omnimoapp.exe" Lang Italian "#SKINSPATH#"][!ActivateConfig "WP7\Gallery\Intro" "introThemeWP7.ini"]
ToolTipText=(Fabio Tuccillo\TheFabio224)

[da]
Meter=String
Text=Ελληνική
MeterStyle=Styk
Y=160
X=2R
LeftMouseUpAction=!Execute ["#ROOTCONFIGPATH#Common\omnimoapp.exe" Lang Greek "#SKINSPATH#"][!ActivateConfig "WP7\Gallery\Intro" "introThemeWP7.ini"]
ToolTipText=jrsall92

[fi]
Meter=String
Text=Suomi
MeterStyle=Styk
LeftMouseUpAction=!Execute ["#ROOTCONFIGPATH#Common\omnimoapp.exe" Lang Finnish "#SKINSPATH#"][!ActivateConfig "WP7\Gallery\Intro" "introThemeWP7.ini"]
ToolTipText=Xyrfo

[uk]
Meter=String
Text=Filipino
MeterStyle=Styk
LeftMouseUpAction=!DExecute ["#ROOTCONFIGPATH#Common\omnimoapp.exe" Lang Filipino "#SKINSPATH#"][!ActivateConfig "WP7\Gallery\Intro" "introThemeWP7.ini"]
ToolTipText=
solidcolor=100,100,100,50
fontcolor=255,255,255,50

[pl]
Meter=String
Text=Polska
MeterStyle=Styk
solidcolor=100,100,100,50
fontcolor=255,255,255,50
LeftMouseUpAction=!DExecute ["#ROOTCONFIGPATH#Common\omnimoapp.exe" Lang Polish "#SKINSPATH#"][!ActivateConfig "WP7\Gallery\Intro" "introThemeWP7.ini"]
ToolTipText=przemas

[du]
Meter=String
Text=Nederlands
MeterStyle=Styk
LeftMouseUpAction=!Execute ["#ROOTCONFIGPATH#Common\omnimoapp.exe" Lang Dutch "#SKINSPATH#"][!ActivateConfig "WP7\Gallery\Intro" "introThemeWP7.ini"]
Y=160
X=2R
ToolTipText=Wesley van der Sanden

[kr]
Meter=String
Text=한국의
MeterStyle=Styk
LeftMouseUpAction=!Execute ["#ROOTCONFIGPATH#Common\omnimoapp.exe" Lang Korean "#SKINSPATH#"][!ActivateConfig "WP7\Gallery\Intro" "introThemeWP7.ini"]
ToolTipText=김건화 \ dheltpdl3

[hu]
Meter=String
Text=বাঙ্গালী
MeterStyle=Styk
LeftMouseUpAction=!Execute ["#ROOTCONFIGPATH#Common\omnimoapp.exe" Lang Bengali "#SKINSPATH#"][!ActivateConfig "WP7\Gallery\Intro" "introThemeWP7.ini"]
ToolTipText=Nahian Kabir (n24)

[tu]
Meter=String
Text=Türk
MeterStyle=Styk
LeftMouseUpAction=!Execute ["#ROOTCONFIGPATH#Common\omnimoapp.exe" Lang Turkish "#SKINSPATH#"][!ActivateConfig "WP7\Gallery\Intro" "introThemeWP7.ini"]
ToolTipText=(supremazy)

[chtrad]
Meter=String
Text=繁體中文
MeterStyle=Styk
LeftMouseUpAction=!Execute ["#ROOTCONFIGPATH#Common\omnimoapp.exe" Lang ChineseTraditional "#SKINSPATH#"][!ActivateConfig "WP7\Gallery\Intro" "introThemeWP7.ini"]
Y=160
X=2R
ToolTipText=<Andrew Liu>

[hindi]
Meter=String
Text=हिंदी
MeterStyle=Styk
LeftMouseUpAction=!Execute ["#ROOTCONFIGPATH#Common\omnimoapp.exe" Lang Hindi "#SKINSPATH#"][!ActivateConfig "WP7\Gallery\Intro" "introThemeWP7.ini"]
ToolTipText=Ankit, Ashish

[ind]
Meter=String
Text=Indonesia
MeterStyle=Styk
LeftMouseUpAction=!Execute ["#ROOTCONFIGPATH#Common\omnimoapp.exe" Lang Indonesian "#SKINSPATH#"][!ActivateConfig "WP7\Gallery\Intro" "introThemeWP7.ini"]
ToolTipText=Guardiola Kevin Taviari

[nan]
Meter=String
Text=?
MeterStyle=Styk
LeftMouseUpAction=!DExecute ["#ROOTCONFIGPATH#Common\omnimoapp.exe" Lang Turkish "#SKINSPATH#"][!ActivateConfig "WP7\Gallery\Intro" "introThemeWP7.ini"]
ToolTipText=
solidcolor=100,100,100,50
fontcolor=255,255,255,50